0Bu/daikin-altherma-esp32/main/http_config.cpp
    if (!broker.empty()) {
        // 1. WiFi connectivity check
        if (!wifi_info().connected) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"WiFi not connected\"}");
        }

        // 2. Validate scheme / credentials leakage policy
        std::string test_uri = broker;
        const bool has_scheme = test_uri.find("://") != std::string::npos;
        const bool is_tls_check = test_uri.rfind("mqtts://", 0) == 0 || test_uri.rfind("wss://", 0) == 0;
        const bool has_creds = !user.empty() || !pass.empty();
        if (!has_scheme) test_uri = "mqtt://" + test_uri;

        if (has_creds && !is_tls_check) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"Credentials require mqtts://\"}");
        }

        // 3. Parse host and port
        std::string host;
        int port = 0;
        bool is_tls = false;
        const char* uri_err = "Invalid broker URI";
        if (!parse_mqtt_uri(test_uri, host, port, is_tls, &uri_err)) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, (std::string("{\"ok\":false,\"error\":\"") + uri_err + "\"}").c_str());
        }

        // 4. Resolve DNS
        struct addrinfo hints{}, *res = nullptr;
        hints.ai_family = AF_INET;
        hints.ai_socktype = SOCK_STREAM;
        char port_str[16];
        std::snprintf(port_str, sizeof(port_str), "%d", port);
        int err = getaddrinfo(host.c_str(), port_str, &hints, &res);
        if (err != 0 || res == nullptr) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"DNS lookup failed\"}");
        }
        struct sockaddr_in target_addr;
        std::memcpy(&target_addr, res->ai_addr, sizeof(struct sockaddr_in));
        freeaddrinfo(res);

        // 5. TCP connection probe
        if (!tcp_port_probe(target_addr.sin_addr, port, 3000)) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"Broker port unreachable\"}");
        }

        // 6. Connect and authenticate with credentials — but only if the heap can afford it.
        // A TLS client spins up a full mbedTLS session (~16 KB in-buf + 4 KB out-buf, each ONE
        // contiguous block) ON TOP of the live bridge's own session. On a fragmented heap that second
        // session can exceed the largest free block and reboot the device. If we can't fit it, skip the
        // connect probe (DNS + port were already checked) and fall through to persist + reboot — the
        // boot path still surfaces a bad broker via /status.mqtt. Better a save without the deep check
        // than an OOM crash on the request path. Threshold is generous for the TLS case.
        const size_t need = is_tls ? 48u * 1024u : 12u * 1024u;
        MqttValidateCtx ctx{};                       // error_msg zero-inits to nullptr
        ctx.sem = xSemaphoreCreateBinary();
        if (ctx.sem && heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT) >= need) {
            esp_mqtt_client_config_t cfg = {};
            cfg.broker.address.uri = test_uri.c_str();
            if (is_tls) cfg.broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
            cfg.credentials.client_id = "daikin_val";
            if (!user.empty()) cfg.credentials.username = user.c_str();
            if (!pass.empty()) cfg.credentials.authentication.password = pass.c_str();
            cfg.session.keepalive = 15;

            esp_mqtt_client_handle_t client = esp_mqtt_client_init(&cfg);
            if (!client) {
                vSemaphoreDelete(ctx.sem);
                httpd_resp_set_status(req, "500 Internal Server Error");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT init failed\"}");
            }

            esp_mqtt_client_register_event(client, static_cast<esp_mqtt_event_id_t>(MQTT_EVENT_ANY),
                                           on_mqtt_validate, &ctx);

            // A failed start never produces an event, so waiting on the semaphore would burn the full
            // 5 s and then blame a "connection timeout" — report the real cause immediately instead.
            // No stop() here: nothing was started.
            if (esp_mqtt_client_start(client) != ESP_OK) {
                esp_mqtt_client_destroy(client);
                vSemaphoreDelete(ctx.sem);
                httpd_resp_set_status(req, "500 Internal Server Error");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT client start failed\"}");
            }

            bool finished = xSemaphoreTake(ctx.sem, pdMS_TO_TICKS(5000)) == pdTRUE;

            esp_mqtt_client_stop(client);       // joins the mqtt task -> the callback can't touch ctx after this
            esp_mqtt_client_destroy(client);
            vSemaphoreDelete(ctx.sem);

            if (!finished) {
                httpd_resp_set_status(req, "400 Bad Request");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT connection timeout\"}");
            }
            if (!ctx.connected) {
                // error_msg is a string literal by construction (see MqttValidateCtx) — never broker
                // text, so it satisfies send_err's no-escaping precondition.
                return send_err(req, "400 Bad Request", ctx.error_msg ? ctx.error_msg : "MQTT connection refused");
            }
        } else {
            if (ctx.sem) vSemaphoreDelete(ctx.sem);
            diag_printf("mqtt: low heap, skipping broker connect probe (DNS+port ok) — saving anyway\n");
        }
    }

    c = config();
    c.mqtt_uri  = broker;
    c.mqtt_user = user;
    c.mqtt_pass = pass;
    // The broker just pre-flighted clean, so a failure here is NVS, not the user's input — don't
    // reboot into the old broker while telling them the new one was accepted.
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

struct RefTempRequest {
    std::string name, topic, path, time_path;
    uint32_t max_age_s = REF_TEMP_MAX_AGE_DEFAULT_S;
    uint32_t test_proof = 0;
};

// Parse Test and Save through one contract. Otherwise the most important guarantee in this dialog
// could drift: the candidate that earned the proof would not necessarily be the mapping persisted.
static const char* parse_ref_temp_request(httpd_req_t* req, RefTempRequest& out) {
    char body[1024];
    if (http_read_body(req, body, sizeof(body)) < 0) return "bad body";
    cJSON* j = cJSON_Parse(body);
    if (!j) return "bad json";
    out.name      = js(j, "name");
    out.topic     = js(j, "topic");
    out.path      = js(j, "temperature_path");
    out.time_path = js(j, "timestamp_path");
    cJSON* age_item = cJSON_GetObjectItem(j, "max_age_s");
    const bool age_type_valid = !age_item || (cJSON_IsNumber(age_item) &&
                                age_item->valuedouble == static_cast<double>(age_item->valueint));
    out.max_age_s = age_item && cJSON_IsNumber(age_item)
                  ? static_cast<uint32_t>(age_item->valueint)
                  : REF_TEMP_MAX_AGE_DEFAULT_S;
    cJSON* proof_item = cJSON_GetObjectItem(j, "test_proof");
    const bool proof_type_valid = !proof_item || (cJSON_IsNumber(proof_item) &&
                                   proof_item->valuedouble >= 0 &&
                                   proof_item->valuedouble <= 2147483647.0 &&
                                   proof_item->valuedouble == std::floor(proof_item->valuedouble));
    if (proof_type_valid && proof_item)
        out.test_proof = static_cast<uint32_t>(proof_item->valuedouble);
    cJSON_Delete(j);

    if (!age_type_valid) return "Maximum age must be a whole number";
    if (!proof_type_valid) return "Test proof must be a whole number";
    if (out.topic.empty()) {                             // empty topic is the explicit Off state
        out.path.clear();
        out.time_path.clear();
    }
    const char* why = nullptr;
    if (!reference_temperature_config_valid(out.name, out.topic, out.path, out.time_path,
                                            out.max_age_s, &why))
        return why ? why : "invalid reference temperature config";
    return nullptr;
}

