0Bu/daikin-altherma-esp32/main/http_config.cpp
static ReferenceTemperatureTestConfig ref_temp_test_config(const RefTempRequest& in) {
    return {in.topic, in.path, in.time_path, in.max_age_s};
}

// Test on the already-authenticated live MQTT connection. Nothing in Config or NVS changes here;
// a successful response hands the browser a one-mapping proof that /set_ref_temp checks again.
static esp_err_t test_ref_temp(httpd_req_t* req) {
    RefTempRequest in;
    if (const char* error = parse_ref_temp_request(req, in))
        return send_err(req, "400 Bad Request", error);
    if (in.topic.empty()) return send_err(req, "400 Bad Request", "MQTT topic is required for a test");

    const ReferenceTemperatureTestResult result = mqtt_reference_test(
        ref_temp_test_config(in), 12000);
    if (!result.passed)
        return send_err(req, "422 Unprocessable Entity",
                        result.error.empty() ? "No fresh MQTT value received" : result.error.c_str());

    char response[192];
    std::snprintf(response, sizeof(response),
                  "{\"ok\":true,\"test_proof\":%lu,\"temperature_c\":%.6g,\"retained\":%s}",
                  static_cast<unsigned long>(result.proof), result.temperature_c,
                  result.retained ? "true" : "false");
    return http_send_json(req, response);
}

// Observation-only room/reference-temperature source. The mapping + freshness policy apply live on
// the existing MQTT connection; no averaging or heat-pump control consumes it yet. A non-empty
// mapping cannot reach Config/NVS until this exact topic/path/age tuple produced a fresh value.
static esp_err_t set_ref_temp(httpd_req_t* req) {
    RefTempRequest in;
    if (const char* error = parse_ref_temp_request(req, in))
        return send_err(req, "400 Bad Request", error);

    const ReferenceTemperatureTestConfig tested = ref_temp_test_config(in);
    if (!in.topic.empty() && !mqtt_reference_test_proof_valid(in.test_proof, tested))
        return send_err(req, "409 Conflict", "Test this MQTT mapping successfully before saving");

    Config c = config();
    if (c.ref_temp_name == in.name && c.ref_temp_topic == in.topic && c.ref_temp_path == in.path &&
        c.ref_temp_time_path == in.time_path && c.ref_temp_max_age_s == in.max_age_s) {
        mqtt_reference_reconfigure();                 // consume the proof + retry the saved mapping
        return http_send_json(req, "{\"ok\":true,\"saved\":false,\"reboot\":false}");
    }
    c.ref_temp_name = in.name;
    c.ref_temp_topic = in.topic;
    c.ref_temp_path = in.path;
    c.ref_temp_time_path = in.time_path;
    c.ref_temp_max_age_s = in.max_age_s;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    mqtt_reference_reconfigure();
    diag_printf("mqtt: reference temperature mapping saved%s\n", in.topic.empty() ? " (disabled)" : "");
    return http_send_json(req, "{\"ok\":true,\"saved\":true,\"reboot\":false}");
}

static esp_err_t set_hp(httpd_req_t* req) {
    char body[2048];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    Config c    = config();
    // The RX/TX pins are the physical X10A wiring: PERSISTED so a manual override survives a reboot
    // (config_save below). The model "profile" is session-only — only touched when the request
    // explicitly sends "profile"; a wiring-only patch omits it so it does not re-select the model or
    // invalidate a settled fingerprint (which would force a spurious re-detect next poll).
    cJSON* profItem     = cJSON_GetObjectItem(j, "profile");
    bool   profile_sent = cJSON_IsString(profItem);
    const int old_rx = c.rx_pin;
    const int old_tx = c.tx_pin;
    // "auto" (the UI's only value) requests a fresh detection; a concrete id pins the model for this
    // session (accepted for API flexibility, never offered in the UI).
    if (profile_sent) c.profile = profItem->valuestring;
    if (set_hp_clears_fingerprint(profile_sent, c.profile)) c.fp_valid = false;
    // proto is auto-detected (hp_detect.cpp), not set from the UI.
    c.rx_pin    = ji(j, "rx", c.rx_pin);
    c.tx_pin    = ji(j, "tx", c.tx_pin);
    const bool reset_checkup =
        set_hp_resets_checkup(profile_sent, old_rx, old_tx, c.rx_pin, c.tx_pin);
    // The HomeHub Modbus stack (issue #32). All optional — an omitted key keeps its stored value, so
    // a wiring-only patch (rx/tx) leaves the HomeHub untouched and the pin picker's
    // {profile:"auto",rx,tx} POST cannot switch anything on. This is a SECOND source, not an
    // alternative to X10A: enabling it starts a separate task, it does not stop the X10A poll.
    // HomeHub configuration has one unambiguous switch: a non-empty address enables polling; an
    // empty address disables the stack and causes no discovery or HomeHub request. Discovery is a
    // separate, explicit /discover_homehub action which only returns an address for the dialog; it
    // never mutates config behind the form's Save/Cancel boundary.
    cJSON* hostItem = cJSON_GetObjectItem(j, "mb_host");
    const bool host_sent = cJSON_IsString(hostItem);
    if (host_sent) c.mb_host = hostItem->valuestring;
    c.mb_port           = ji(j, "mb_port", c.mb_port);
    c.mb_unit_id        = ji(j, "mb_unit_id", c.mb_unit_id);
    c.actuation_enabled = jb(j, "actuation_enabled", c.actuation_enabled);
    cJSON_Delete(j);
    std::string reason;
    // Pass the real Kconfig-derived octal-SPI + status-LED facts (config.cpp) so validate() rejects a
    // chip-reserved GPIO — a flash/strapping/JTAG pad the UI dropdown never offers but a raw curl POST
    // could send — with the pin named, instead of range-accepting it and persisting a crash-loop pair.
    if (!validate(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi(), config_reserved_pins(c)))
        return send_err(req, "400 Bad Request", reason.c_str());
    // This route OWNS the pin cache, unlike the service routes whose link writes are only
    // best-effort maintenance. Require all three cache keys; on failure RAM stays untouched, so
    // there is no new link to hand the poll engine and reconfigure must be skipped.
    if (!config_save(c, /*require_link=*/true))
        return send_err(req, "500 Internal Server Error", "config write failed");
    if (reset_checkup) {
        checkup_reset();
        hp_poll_reconfigure();
    }
    // The HomeHub stack is told separately, because it IS separate: this starts or stops its task
    // and re-resolves its address without touching the X10A poll engine above.
    mb_reconfigure();
    return http_send_json(req, "{\"ok\":true}");
}

